## Pandas

In [1]:
import pandas as pd

## DataFrame
- dictionary of list

In [4]:
info = {
    "Name":["abjd", "sxawd", "wdsad"],
    "CGPA":[4.34,7.65,9.76]
}

df = pd.DataFrame(info)
df

    Name  CGPA
0   abjd  4.34
1  sxawd  7.65
2  wdsad  9.76

In [22]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [30]:
print(df.columns)
print(df.index)

Index(['Name', 'CGPA'], dtype='object')
RangeIndex(start=0, stop=3, step=1)

## list of list(DataFrame)

In [32]:
df1 = pd.DataFrame([["abc", 67], ["sam", 88],["jon", 65]], columns = ["Name", "age"])
df1

  Name  age
0  abc   67
1  sam   88
2  jon   65

## numpy array(DataFrame)

In [33]:
import numpy as np
arr = np.array([[1,2,3],[4,5,6]])
df3 = pd.DataFrame(arr, columns = ["a", "c", "c"])
df3

   a  c  c
0  1  2  3
1  4  5  6

## Series Note : Capital 's'

In [14]:
s = pd.Series([23,43,54,4,32])# index
print(s)

0    23
1    43
2    54
3     4
4    32
dtype: int64

In [15]:
s1 = pd.Series([23,43,54,4,32], index=["asam", "swsqs", "saxas", "ewed", "wewx"]) # here index become level
print(s1)

asam     23
swsqs    43
saxas    54
ewed      4
wewx     32
dtype: int64

In [13]:
print(s[0]) # accessing ele like array

23

## dtype: object if we do [23,43,54,4,32, "abc"] 
- A pandas Series is **homogeneous** by design, meaning it holds a single dtype.
- When mixed data types are provided, pandas upcasts all values to object, making it technically homogeneous in dtype.
- However, logically the data is heterogeneous, so it is not suitable for numerical computation or ML models.

In [16]:
s1 = pd.Series([23,43,54,4,32, "abc"], index=["asam", "swsqs", "saxas", "ewed", "wewx", 54]) # here index become level
print(s1)

asam      23
swsqs     43
saxas     54
ewed       4
wewx      32
54       abc
dtype: object

## Vectorized Operation in pandas
- Vectorization means performing operations on entire arrays/Series at once, without using explicit loops.

In [18]:
ser1 = pd.Series([1,2,3,4])
ser2 = pd.Series([10,20,30,40])
sum = ser1+ser2
sum

0    11
1    22
2    33
3    44
dtype: int64

## Values of series are Mutable

In [19]:
series1 = pd.Series([3,4,5,6])
series1[0] = 100
series1

0    100
1      4
2      5
3      6
dtype: int64

## Size of series are Immutable

In [20]:
series1.drop(0)

1    4
2    5
3    6
dtype: int64

In [21]:
series1 # see even drop size original remains same

0    100
1      4
2      5
3      6
dtype: int64

## Read Data from csv

In [38]:
df4 = pd.read_csv("data/employee_data.csv")
df4

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000

# pandas DataFrame Quick Methods

- `df.head()`  
  Show first 5 rows (default) of the DataFrame

- `df.tail()`  
  Show last 5 rows (default) of the DataFrame

- `df.sample()`  
  Show random sample rows (default 1 row)

- `df.info()`  
  Summary: data types, non-null counts, memory usage

- `df.shape`  
  Tuple with (rows, columns)

- `df.describe()`  
  Statistical summary of numeric columns

- `df.columns`  
  List of column names

- `df.nunique()`  
  Number of unique values per column

In [44]:
df4.describe()

             ID        Age        Salary
count  10.00000  10.000000     10.000000
mean    5.50000  32.900000  64500.000000
std     3.02765   6.674162  15182.226451
min     1.00000  25.000000  47000.000000
25%     3.25000  28.250000  51250.000000
50%     5.50000  31.000000  62500.000000
75%     7.75000  37.250000  74250.000000
max    10.00000  45.000000  91000.000000

## Read Data from JSON

In [48]:
df5 = pd.read_json("data/jsondata.json")
df5.head()

                                            employee
0  {'id': 'E00001', 'name': 'Matthew Snyder', 'po...
1  {'id': 'E00002', 'name': 'David Carter', 'posi...
2  {'id': 'E00003', 'name': 'Carol Durham', 'posi...
3  {'id': 'E00004', 'name': 'Peter Johnson', 'pos...
4  {'id': 'E00005', 'name': 'Stacy Jacobson', 'po...